Discovering relationships between variables is the fundamental goal of data analysis. Frequency tables are a basic tool you can use to explore data and get an idea of the relationships between variables. A frequency table is just a data table that shows the counts of one or more categorical variables.
Frequency tables are also known as crosstabs.

In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
os.listdir()

['.ipynb_checkpoints',
 'Arrays.ipynb',
 'dict.ipynb',
 'EmptyTest.csv',
 'Exploring_Cleaning.ipynb',
 'Frequency_Tables.ipynb',
 'gender_submission.csv',
 'JoiningData.xlsx',
 'Joining_data.ipynb',
 'PandasDataFrames.ipynb',
 'ReadingAndWritingData.ipynb',
 'sqlite.db',
 'test.csv',
 'train.csv',
 'Untitled.ipynb']

In [2]:
df_train = pd.read_csv('train.csv')
str_cabin = df_train['Cabin'].astype(str)  
new_cabin = np.array([cabin[0] for cabin in str_cabin]) #take first letter
df_train['Cabin'] = pd.Categorical(new_cabin)   #save new cabin variable

In [12]:
df_train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S

# One way tables

In [14]:
my_table = pd.crosstab(index = df_train['Survived'],   #make a crosstab
                      columns = 'totalcount') #to name the column as totalcount
my_table

col_0     totalcount
Survived
0                549
1                342

In [15]:
type(my_table)   #corfirm that the crosstab is a DF

pandas.core.frame.DataFrame

In [24]:
cabin_tab = pd.crosstab(index = df_train['Cabin'],   #make a crosstab
                      columns = 'count')
cabin_tab

col_0  count
Cabin
A         15
B         47
C         59
D         33
E         32
F         13
G          4
T          1
n        687

In [17]:
pd.crosstab(index = df_train['Sex'],   #make a crosstab
                      columns = 'countall')

col_0   countall
Sex
female       314
male         577

We can also use simple value_counts() BUT difference is that it doesn't make a DF. A crosstab results in a DF in which we can furthur do all DF operations.

In [19]:
xyz = df_train.Sex.value_counts()
xyz

male      577
female    314
Name: Sex, dtype: int64

In [20]:
type(xyz)

pandas.core.series.Series

In [25]:
print(cabin_tab.sum(), '\n')
print(cabin_tab.shape, '\n')
cabin_tab.iloc[1:7]   #slice rows 1-6

col_0
count    891
dtype: int64

(9, 1)

col_0  count
Cabin
B         47
C         59
D         33
E         32
F         13
G          4

In [26]:
cabin_tab/cabin_tab.sum()

col_0     count
Cabin
A      0.016835
B      0.052750
C      0.066218
D      0.037037
E      0.035915
F      0.014590
G      0.004489
T      0.001122
n      0.771044

# Two-Way Tables (contingency tables)

Two-way tables can give you insight into the relationship between two variables.

In [3]:
survived_sex = pd.crosstab(index = df_train['Survived'],  
                      columns = df_train['Sex'])
# survived_sex.index = ['died','survived']   #renaming index from 0 and 1 to died and survived
survived_sex

Sex       female  male
Survived
0             81   468
1            233   109

In [8]:
# Table of survival vs passenger class
survived_class = pd.crosstab(index = df_train["Survived"], 
                            columns = df_train["Pclass"])
survived_class.columns = ['class1','class2','class3'] #to remane columns use df.columns
survived_class

          class1  class2  class3
Survived
0             80      97     372
1            136      87     119

You can get the marginal counts (totals for each row and column) by including the argument margins=True:

In [9]:
survived_class = pd.crosstab(index = df_train["Survived"], 
                            columns = df_train["Pclass"],
                            margins =True)
survived_class.columns = ['class1','class2','class3','rowtotal']
survived_class.index = ['died','survived','coltotal']
survived_class

          class1  class2  class3  rowtotal
died          80      97     372       549
survived     136      87     119       342
coltotal     216     184     491       891

In [17]:
survived_class/survived_class.loc["coltotal","rowtotal"] #To get the total proportion of counts in each cell, divide the table by the grand total

            class1    class2    class3  rowtotal
died      0.089787  0.108866  0.417508  0.616162
survived  0.152637  0.097643  0.133558  0.383838
coltotal  0.242424  0.206510  0.551066  1.000000

# Higher Dimensional Tables

In [10]:
surv_sex_class = pd.crosstab(index = df_train["Survived"], 
                             columns = [df_train["Pclass"],
                                        df_train["Sex"]],
                             margins = True)   # Include row and column totals

surv_sex_class

Pclass        1           2           3       All
Sex      female male female male female male
Survived
0             3   77      6   91     72  300  549
1            91   45     70   17     72   47  342
All          94  122     76  108    144  347  891

In [11]:
surv_sex_class[2]        # Get the subtable under Pclass 2

Sex       female  male
Survived
0              6    91
1             70    17
All           76   108

In [14]:
surv_sex_class[1]        # Get the subtable under Pclass 1

Sex       female  male
Survived
0              3    77
1             91    45
All           94   122

In [15]:
surv_sex_class[2]["male"]   # Get male column within Pclass 2

Survived
0       91
1       17
All    108
Name: male, dtype: int64

In [16]:
surv_sex_class/surv_sex_class.loc["All"]    # Divide by column totals

Pclass           1                   2                3                 All
Sex         female      male    female      male female      male
Survived
0         0.031915  0.631148  0.078947  0.842593    0.5  0.864553  0.616162
1         0.968085  0.368852  0.921053  0.157407    0.5  0.135447  0.383838
All       1.000000  1.000000  1.000000  1.000000    1.0  1.000000  1.000000